### 누락된 데이터

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark','artichoko',np.nan,'avocado'])
string_data

0     aardvark
1    artichoko
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned = data.dropna() # NaN을 하나라도 갖는 행은 삭제
data,cleaned

(     0    1    2
 0  1.0  6.5  3.0
 1  1.0  NaN  NaN
 2  NaN  NaN  NaN
 3  NaN  6.5  3.0,
      0    1    2
 0  1.0  6.5  3.0)

In [12]:
data.dropna(how='all') # 모두 NaN인 행만 삭제

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.151619  0.272806 -1.667391
1  0.680160  0.010663 -1.838372
2  1.530143 -1.341167 -0.896328
3  1.422837 -1.383212  0.261332
4 -1.191844  1.296594  0.234698
5  0.823999 -1.369631 -1.340064
6 -0.157954  0.759177  0.449235

In [16]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.151619       NaN       NaN
1  0.680160       NaN       NaN
2  1.530143       NaN -0.896328
3  1.422837       NaN  0.261332
4 -1.191844  1.296594  0.234698
5  0.823999 -1.369631 -1.340064
6 -0.157954  0.759177  0.449235

In [17]:
df.dropna()

          0         1         2
4 -1.191844  1.296594  0.234698
5  0.823999 -1.369631 -1.340064
6 -0.157954  0.759177  0.449235

In [18]:
df.dropna(thresh=2) # 값을 가진(NaN이 아닌)개수를 지정하여 그 이상인 row만 조회

          0         1         2
2  1.530143       NaN -0.896328
3  1.422837       NaN  0.261332
4 -1.191844  1.296594  0.234698
5  0.823999 -1.369631 -1.340064
6 -0.157954  0.759177  0.449235

In [19]:
df.fillna(0) # 0채워 넣기

          0         1         2
0 -0.151619  0.000000  0.000000
1  0.680160  0.000000  0.000000
2  1.530143  0.000000 -0.896328
3  1.422837  0.000000  0.261332
4 -1.191844  1.296594  0.234698
5  0.823999 -1.369631 -1.340064
6 -0.157954  0.759177  0.449235

In [20]:
df.fillna({1:0.5,2:0}) # column마다 처리 기준이 달라지게 할 수 있다.

          0         1         2
0 -0.151619  0.500000  0.000000
1  0.680160  0.500000  0.000000
2  1.530143  0.500000 -0.896328
3  1.422837  0.500000  0.261332
4 -1.191844  1.296594  0.234698
5  0.823999 -1.369631 -1.340064
6 -0.157954  0.759177  0.449235

In [21]:
df.fillna(0,inplace=True) # 변환하여 df에 반영

In [22]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0  1.905979 -2.197722  0.940997
1  1.365057 -1.829245  0.443283
2 -1.258833       NaN  0.734144
3 -0.116213       NaN -1.181771
4  1.338142       NaN       NaN
5  1.023537       NaN       NaN

In [23]:
df.fillna(method='ffill')

          0         1         2
0  1.905979 -2.197722  0.940997
1  1.365057 -1.829245  0.443283
2 -1.258833 -1.829245  0.734144
3 -0.116213 -1.829245 -1.181771
4  1.338142 -1.829245 -1.181771
5  1.023537 -1.829245 -1.181771

In [38]:
df.fillna(df.mean(0)) #열별 평균값으로 채우기

          0         1         2
0  1.905979 -2.197722  0.940997
1  1.365057 -1.829245  0.443283
2 -1.258833 -2.013483  0.734144
3 -0.116213 -2.013483 -1.181771
4  1.338142 -2.013483  0.234163
5  1.023537 -2.013483  0.234163

In [30]:
df.mean(1)

0    0.216418
1   -0.006968
2   -0.262345
3   -0.648992
4    1.338142
5    1.023537
dtype: float64

## 데이터 변형

In [39]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated() # 중복여부 판단

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates() # 중복제거

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [43]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [44]:
data.drop_duplicates(['k1']) # 지정 column 값이 중복인 경우 삭제(처음값만 남김)

    k1  k2  v1
0  one   1   0
1  two   1   1

In [45]:
data.drop_duplicates(['k1','k2'],keep='last') # 마지막만 남김

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 함수,매핑을 통한 변형

In [46]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [50]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 값 치환하기

In [53]:
data = pd.Series([1.,-999,2,-999,-1000,3])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace(-999,NA) # 값 치환

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999,-1000],NA)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999,-1000],[NA,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999:NA, -1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### column index 이름 바꾸기

In [60]:
data = pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'],columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [61]:
transform = lambda x: x[:4].upper()

data.index.map(transform) # index에 map 함수 있다.

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [63]:
data.index = data.index.map(transform) #index 변경

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
data.rename(index=str.title,columns=str.upper) # 원래 data는 변하지 않는다.

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [65]:
data.rename(index={'Ohio':'INDIANA'},columns={'three':'peekaboo'})

      one  two  peekaboo  four
OHIO    0    1         2     3
COLO    4    5         6     7
NEW     8    9        10    11

### 개별화,양자화

In [67]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100] # 그룹으로 나눌 기준

In [69]:
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes # 나눈 값들을 숫자코드로 바꿔놓은것

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
cats.categories # 항목

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [73]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [77]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior'] # 그룹별 이름 지정
cat = pd.cut(ages,bins,labels=group_names)
cat[0]

'Youth'

In [98]:
data = np.random.rand(20)
data

array([0.29574262, 0.34851094, 0.78723664, 0.35771696, 0.72457828,
       0.90626773, 0.50163646, 0.36458144, 0.22110234, 0.17611973,
       0.41876519, 0.53637146, 0.07817847, 0.03857434, 0.47828323,
       0.30302634, 0.35100677, 0.01476214, 0.71220253, 0.66571159])

In [100]:
pd.cut(data,5,precision=2) # 숫자로 입력하면 최대최솟값을 경계로 등분하여 준다. precision: 소수점 자릿수 제한

[(0.19, 0.37], (0.19, 0.37], (0.73, 0.91], (0.19, 0.37], (0.55, 0.73], ..., (0.19, 0.37], (0.19, 0.37], (0.014, 0.19], (0.55, 0.73], (0.55, 0.73]]
Length: 20
Categories (5, interval[float64]): [(0.014, 0.19] < (0.19, 0.37] < (0.37, 0.55] < (0.55, 0.73] < (0.73, 0.91]]

In [102]:
data = np.random.randn(1000)
data

array([ 1.63689028e-01,  8.79246196e-01,  7.03818245e-01,  1.25603061e+00,
        9.67904910e-02, -9.44680318e-01,  1.27632733e+00, -5.86830281e-02,
        1.04694707e+00, -4.98891034e-02, -1.82194289e+00, -7.54993478e-01,
        9.83261283e-01, -7.76679853e-01, -1.69488912e-01, -2.76305414e-01,
        6.11520548e-02,  3.98984977e-01,  9.07105622e-01, -5.64554220e-01,
       -1.01151810e-01, -5.25423490e-01, -7.55726870e-01,  1.48086938e+00,
       -8.88873985e-01, -6.84121818e-01, -3.91293678e-01, -1.28695360e+00,
        1.32751317e+00, -7.53028396e-01,  8.68929414e-01,  4.02125122e-01,
        7.34379961e-01,  2.27419954e-01,  5.18814144e-01,  1.27119105e+00,
       -4.21020335e-01, -4.14182354e-01,  4.34338774e-01,  5.75358664e-01,
        1.03083750e+00, -1.10669664e+00,  1.10535685e+00, -9.22210244e-02,
       -1.77777098e+00, -9.15482725e-01, -1.49628219e+00, -1.83744705e+00,
        5.28961414e-01, -8.28025967e-02,  1.01190698e+00,  2.47782441e-03,
        5.11178327e-01,  1.23134825e+00, -1.98463194e+00, -1.78542808e+00,
        4.30538895e-01, -1.21408469e+00,  7.57526912e-01, -1.83581035e-01,
       -5.30217093e-01, -5.34320505e-01, -8.49009843e-01,  1.89172197e-01,
       -1.12422020e+00, -1.32620290e+00,  1.71627485e+00,  1.00851357e+00,
        1.10042404e+00, -1.19641564e+00, -6.97369217e-01, -7.86396401e-02,
        2.29960374e+00,  7.01697763e-01,  6.67849995e-01, -1.22529324e+00,
        5.25134454e-01, -1.39971152e-01, -1.55240534e+00,  7.72190322e-01,
        8.71038815e-01,  1.56165141e+00,  1.89963939e+00,  1.66403704e+00,
       -1.35257003e+00,  1.11800692e-02,  1.80320591e+00,  1.23120585e+00,
        4.29769308e-02, -3.45071482e-02, -6.94942584e-01, -4.07805372e-01,
       -4.44128328e-01,  5.05745000e-01, -5.54834492e-01,  1.39390924e+00,
       -1.06005411e+00, -6.62102675e-01, -4.94998283e-01, -1.19424313e-01,
       -6.08578426e-01, -2.26397790e+00, -1.30240943e+00,  5.69974373e-01,
       -8.66059883e-01, -3.24928728e-02, -6.93308118e-01,  6.12206821e-01,
       -3.10261835e-01, -5.22268276e-01, -9.53116671e-01, -2.19802255e+00,
        2.37681922e+00,  4.93577858e-01, -2.01856560e+00, -4.08675117e-01,
        2.36112587e+00,  1.67341589e+00, -1.60409590e+00,  2.57095608e-01,
       -6.58222049e-02,  1.48415456e+00,  4.14445379e-01, -9.42758417e-01,
       -2.61493232e-02,  8.37148459e-01,  5.06962603e-02, -3.21246369e-01,
        7.16241727e-01,  3.27817246e-01, -9.28724939e-01,  1.04475600e+00,
       -5.25635039e-01, -9.34613493e-01, -8.60958105e-02, -1.16608377e+00,
        8.13204416e-02, -1.31392339e+00, -1.49410748e+00,  2.79344248e-01,
        1.43730243e+00, -7.32655617e-01,  1.43827362e-01,  5.46839555e-01,
       -5.31616637e-01,  1.64559522e-01,  1.30382866e+00,  9.84871612e-02,
        1.21913065e+00,  5.37712962e-01, -1.18802776e+00,  1.26985313e+00,
       -5.64521704e-01,  1.68586164e+00,  2.20701676e-01, -1.60621800e+00,
        1.67947166e-01, -3.18706629e-01, -1.75076923e-01, -2.77905586e-01,
        1.49016392e+00, -2.21857446e-01, -3.10740659e-01, -7.57827196e-01,
       -1.10996615e+00,  4.93483793e-01,  7.10729186e-01, -4.85289942e-01,
       -9.12119036e-02,  1.16544672e+00, -3.36983144e-01,  9.64382594e-02,
        5.67014882e-01,  7.73665875e-01,  8.57261640e-01, -2.19525217e+00,
       -4.78027433e-01, -1.72177438e+00, -2.74416898e-01, -2.00894050e+00,
        4.66097133e-01,  1.57365783e-01,  6.83515590e-01, -3.35001200e-01,
       -1.81311163e+00,  5.30268450e-01,  2.30023142e+00,  2.88174890e+00,
        6.58354508e-01,  5.91754164e-01, -8.23262842e-02, -1.25792541e+00,
        1.04062553e+00, -2.51159914e-01,  6.50825280e-01,  1.58200129e-02,
       -8.00763036e-01,  1.28208830e-01, -1.58052803e+00,  1.83291904e-01,
        1.30091151e+00,  1.29586968e+00,  2.19296179e+00,  8.82636275e-02,
       -1.36596760e-01,  2.19028749e-01, -1.14698359e+00, -7.65071798e-02,
       -2.43078970e+00, -9.82355342e-01,  4.51913920e-01, -7.61359556e-01,
        5.48415469e-02, -8.23115835e-01, -6.06589375e-01, -1.89137873e-01,
       -4.39174320e-01,  3.48230047e-01, -9.56823808e-01,  9.90297661e-01,
       -1.18067395e+00,  1.62190991e+00, -2.00801536e-01, -4.77761757e-01,
       -5.06217834e-01,  6.60981267e-01,  1.46947684e+00,  8.38413048e-01,
        5.55822359e-01, -1.56589250e+00,  7.83003230e-01, -7.82782793e-01,
       -3.00056443e-01, -6.56091306e-01, -8.49296808e-02, -2.30997532e-01,
        1.25014883e+00,  2.06144475e-01, -8.56644409e-01, -1.64287251e+00,
        1.24348590e+00,  3.04310449e-01, -1.02771996e+00,  3.18589203e-01,
        1.74866014e+00, -6.74854393e-01,  1.39500171e-01, -1.75587414e-01,
        2.40392256e-01,  4.57525030e-01,  1.88391251e+00, -4.13565669e-01,
        3.37779327e-01,  1.63311161e+00,  2.49421776e+00,  5.81666992e-02,
        3.97744184e-01, -3.45258388e-01,  4.22504627e-01, -7.69728287e-01,
       -4.63934635e-01, -6.06731096e-01, -2.03451059e+00, -2.26922523e-01,
       -5.20853107e-01, -6.28765655e-02, -6.96747574e-02,  5.09464814e-01,
       -1.05996876e+00,  7.59244583e-02, -8.44896059e-01, -6.48595313e-01,
       -6.92674643e-01,  1.42715614e+00,  1.15151426e+00, -3.05985286e-01,
        1.74069435e+00, -1.62552585e+00, -3.21709492e-01, -1.44374746e+00,
        8.58748753e-01, -3.57089438e-02, -2.60872196e-01,  6.26378177e-01,
       -1.35646096e+00, -1.54114744e-01,  8.60359021e-01, -1.41951274e-01,
        1.03315100e+00, -1.07666389e+00,  1.22047497e+00,  1.69621992e-01,
        8.30140133e-01, -2.22903612e+00,  1.07565929e+00, -9.67952324e-01,
       -4.79198552e-02,  9.34944164e-01, -1.71884214e-01, -8.85375232e-01,
       -2.51546446e-01,  9.04656598e-01, -8.70154771e-01,  7.73035519e-01,
        1.82491650e-01, -4.09139400e-01, -9.13746934e-01, -6.88725961e-01,
        1.12194817e+00, -9.50231543e-01, -1.75748070e+00, -1.01976796e+00,
        1.08102873e-01, -2.09758546e-03,  5.47296478e-01,  8.64022832e-01,
        3.33341897e-01, -9.29959961e-02,  5.55955872e-01, -3.81533652e-01,
        1.23157918e-01, -1.07324230e+00, -4.98101853e-01,  1.81107477e-01,
       -5.92310915e-01, -8.08833160e-01,  2.54727344e-01,  3.20781516e-02,
        1.92275583e-01, -3.36373269e-01, -3.45769541e-01, -1.09066542e-01,
       -9.77781972e-01,  1.25801012e+00, -2.15284230e-02, -1.92589363e-01,
        2.28457972e+00,  9.23486332e-01, -2.72420408e+00,  6.09593172e-01,
       -2.96528976e-01, -5.32294790e-01, -9.94789286e-01,  2.62160694e-01,
        9.82028800e-01,  1.08159249e+00,  1.15077138e+00, -2.02337168e+00,
        1.26222052e-01, -5.99995199e-01,  7.10098653e-01,  5.63808460e-01,
        4.64556801e-01,  1.01472352e+00,  1.33037562e+00,  1.04252035e+00,
        6.61518640e-01, -2.50426600e-02, -3.97162117e-01,  2.27343635e-01,
       -3.21040399e-01,  3.95435476e-01,  1.16330792e+00,  2.13207776e+00,
        2.03245583e+00, -8.32126733e-01, -1.44741468e-01,  2.14149300e+00,
        1.34415613e-01, -1.90030256e-01, -1.47666740e+00, -2.93171691e-01,
        6.45214034e-01, -1.06381712e-01,  1.17556336e+00,  9.96628864e-01,
       -1.69591253e-01, -1.18546027e+00, -1.00598703e+00, -5.62777143e-01,
       -2.94940898e-01, -1.18557745e+00,  1.72460089e+00, -5.51713491e-01,
        1.41646049e-01, -1.15081945e+00, -1.07179158e+00, -2.37277810e-01,
        5.57310873e-02, -1.37391519e+00, -1.09601340e+00, -1.82348695e+00,
       -1.19757465e+00, -2.36127060e-01,  1.28907746e+00,  4.35251183e-01,
       -1.35657277e+00, -6.41477704e-01,  5.73650797e-01,  2.43499864e+00,
       -9.32472685e-01,  1.11718003e+00,  9.41511938e-02, -1.32002532e-01,
        4.61953302e-01, -1.45597862e+00, -1.07131589e+00,  1.12819221e+00,
        6.48863776e-01,  3.36328782e-01, -8.07322261e-01, -1.33433673e+00,
        9.84431016e-02,  5.60034893e-01, -6.85949265e-02,  2.61874925e-01,
        1.26119100e+00, -7.25805381e-01, -1.31773124e-01, -2.08052061e-01,
        1.76396149e-01, -1.00264089e+00, -6.15177997e-01, -1.34855130e+00,
       -4.15516639e-01, -3.31299150e-01, -1.16471443e+00,  7.74305645e-01,
       -1.08597955e-01,  4.50963898e-01,  6.17077481e-02,  1.19862471e-01,
       -7.26859340e-01, -5.63403995e-02, -1.20102140e+00, -1.64765338e+00,
        3.03739649e-01, -9.62820280e-01,  8.51718294e-01, -1.04440220e+00,
        1.05281438e+00,  2.18754412e+00,  1.31699526e+00, -7.02270938e-03,
       -7.25459953e-01,  1.64933677e+00,  5.89963645e-01, -2.53917111e-01,
        1.77195029e+00, -9.74137396e-01,  2.03284697e+00,  6.37050521e-01,
       -5.45579343e-02,  4.18771594e-01,  3.22711656e-01, -1.20434403e+00,
        5.56632470e-01, -6.83946844e-01, -1.07017300e-01,  7.01194130e-02,
        1.50963454e+00,  1.27411222e+00, -1.06107562e+00,  5.58107888e-01,
       -3.42467196e-01,  2.63663498e-01,  8.56708888e-01,  1.11045267e-01,
        1.05942447e-01,  3.87917469e-01, -2.49506555e+00, -3.96410826e-01,
        1.23085108e+00,  6.51051853e-01,  1.28707212e+00,  1.08835734e+00,
        8.11907222e-01,  1.89784295e-01,  9.98126736e-01, -5.61255481e-01,
        1.32479834e+00,  1.26148421e+00,  1.99953247e-01,  5.11074847e-01,
       -3.49927282e-02, -2.57345088e-02, -5.14151038e-01,  4.10003219e-01,
       -1.10794812e-01,  2.46787865e-01, -1.69630523e+00, -4.13952988e-01,
       -4.78028911e-02,  8.42239739e-02,  8.49125952e-02,  8.34818095e-02,
       -3.41471904e-01,  1.99250080e+00, -4.31052846e-01, -2.88233072e-01,
       -7.70439550e-02, -5.66868788e-01, -9.40751014e-01,  3.50043378e-01,
       -1.10707754e-01,  1.01061216e+00,  1.01331831e-02,  1.93108436e+00,
        4.46171674e-01,  1.87790019e-01,  6.61706718e-01, -7.20574727e-01,
        2.99218255e-01, -5.09881995e-02, -4.30799320e-01,  1.49245040e-01,
        2.29205824e-01, -7.43825511e-01, -1.05162487e+00,  6.73326653e-01,
       -2.94020857e-01,  3.68973070e-01,  1.08375336e+00,  1.25973634e+00,
       -8.38235759e-01,  1.71575759e+00, -1.73550594e-01,  1.32221178e+00,
        1.18256037e+00, -2.52251177e-01,  1.45664467e-01, -1.13032243e+00,
        2.38053896e+00, -3.90754661e-02,  2.60422634e-01,  1.20341860e+00,
        1.00910747e+00, -9.42446829e-01, -2.23918268e-01, -9.47949093e-01,
        1.51701975e-01,  4.37707438e-01, -5.65375441e-01,  7.33581602e-01,
       -2.04960400e+00, -4.21916741e-02, -7.67337163e-01, -1.38542201e+00,
       -4.45700613e-01,  4.91141477e-01,  2.92073008e-01, -1.68200898e+00,
        5.31067668e-01, -2.85234294e-01,  2.47469422e-02,  1.10439166e+00,
       -9.43314697e-01,  1.29153952e+00, -1.06201907e+00, -1.75275295e-02,
        1.94891766e+00, -1.39097555e+00,  1.80926638e+00, -8.90271841e-01,
        1.44966128e-01,  8.13162059e-01, -4.86335950e-01,  8.47178911e-01,
        1.08522364e-01, -1.29728545e-01,  4.98135237e-02, -9.28160457e-01,
       -6.54879087e-01, -2.35746997e+00, -8.61798315e-01, -9.97686866e-02,
        2.37225223e-01,  9.51893831e-01, -1.37938930e-01,  1.72163910e+00,
        8.78515958e-01, -2.17924204e-01,  2.97030448e-01, -4.28804250e-02,
       -5.86096575e-01,  9.34081791e-02,  1.02678985e+00, -1.56090272e+00,
       -6.27681749e-01, -6.81314768e-01,  6.52058188e-01, -8.02802796e-01,
        4.28652789e-01,  1.18397589e+00,  6.29015249e-01,  1.95468655e-01,
       -9.02739103e-01,  1.30282430e+00,  5.61238902e-01,  7.23156089e-01,
        1.30033950e+00, -2.70694642e-01,  5.76334690e-01,  2.56173841e-01,
       -1.17533885e+00,  3.75267004e-01, -2.44564040e-01, -1.76448663e-01,
        1.17336156e+00,  3.19815277e-01,  1.13742022e+00,  1.20470988e-01,
       -1.10955522e+00, -8.35629021e-01,  6.62059427e-01,  3.34277891e-01,
       -2.62140840e-01,  6.66134455e-01, -7.77438537e-01, -2.16815652e-01,
       -2.16520449e-01, -6.23247630e-01, -1.37390877e+00,  1.02883331e-01,
        8.87822694e-02, -3.30951307e-01,  5.48337545e-01, -1.37189295e+00,
        8.92375682e-01, -4.52295367e-02, -1.44153333e+00, -9.35938192e-01,
       -4.52751609e-01,  8.74502661e-01,  8.63531557e-01, -1.22949560e-01,
        7.58866762e-01, -5.67255109e-01, -6.32657567e-01, -1.81877434e+00,
       -3.18440827e-01, -3.73540346e-01, -5.33781374e-01, -1.40219290e+00,
       -6.46148397e-01, -7.17614026e-01,  4.00087668e-01,  4.47907066e-01,
        1.66850046e+00, -1.97308034e+00,  7.08469537e-01,  2.12468721e+00,
        5.18629143e-01, -1.14323988e-01,  6.70107515e-02, -2.43319042e-01,
        3.82750500e-01, -8.04043471e-01, -9.02306517e-01,  7.78825726e-01,
       -1.54443123e+00, -1.43701095e+00, -4.93063619e-01,  1.01411717e+00,
       -4.04249905e-01,  2.03655803e-01,  1.85044421e+00, -4.67333031e-01,
       -2.66474354e+00, -1.12012735e+00, -2.21948059e+00, -4.02087074e-01,
        1.23040306e+00,  6.29980417e-01, -3.77601324e-02, -6.45381530e-01,
        2.77495353e-01, -8.06934339e-01, -8.03579044e-01,  3.90307444e-01,
        8.70487914e-01,  1.16914499e+00, -3.76405628e-01, -1.44671767e-01,
        1.51689059e+00,  1.13988604e+00, -2.50516415e-01, -7.73301044e-02,
        1.02855054e+00, -3.14935813e-01,  8.26732130e-01, -3.55435421e-01,
        1.34990953e+00, -4.40206524e-01,  9.78774456e-01, -8.13401691e-01,
       -3.23151601e-01,  1.01100096e+00,  1.64683192e+00, -1.45563399e-01,
       -5.36367446e-01, -1.42294857e+00, -2.10035442e+00,  1.96958446e+00,
       -1.85162366e+00,  2.53223117e+00, -2.13432111e-01,  9.39727906e-01,
       -1.29478479e+00,  1.58280726e+00,  4.73698447e-01, -9.57157510e-02,
       -5.58374282e-01, -7.78368900e-01,  8.06312052e-01, -6.93862926e-01,
       -9.84365545e-01,  5.10012393e-02, -1.79320026e-01,  1.92958569e+00,
        1.03264464e+00,  1.53091531e+00,  1.69757577e+00, -8.97805765e-01,
       -6.58643051e-01, -6.32237390e-01,  4.45115643e-01, -2.49172133e-01,
       -4.80711672e-02, -1.89782825e+00,  2.30024851e-01, -7.46493378e-01,
        2.11689734e-01,  1.88034265e+00, -1.21946313e+00, -1.27190261e+00,
       -1.23168347e+00, -7.01802779e-01,  2.02383385e-01,  2.82650469e-01,
       -3.80175680e-01,  6.21034675e-01, -4.93272844e-01, -1.26524253e+00,
       -3.37090068e-01,  9.97846638e-01, -1.08640742e+00, -7.01465010e-02,
       -1.01750321e+00, -1.86364861e+00,  1.17702972e+00, -4.78716419e-01,
       -2.97748260e-01, -1.34209688e+00, -1.30786091e+00, -3.97392278e-02,
        4.25478398e-01, -6.47832252e-01,  3.38900423e-01, -4.25340683e-01,
        8.41886270e-02,  2.47095498e-02, -1.48936594e+00, -4.37922658e-01,
        1.12254754e+00,  7.41052437e-01, -1.83927019e+00, -5.50015856e-02,
       -1.85748441e+00, -8.91614628e-01, -5.89840108e-01, -1.02622491e+00,
       -4.77497319e-01,  3.81148480e-01,  2.74099536e-01, -5.54027573e-01,
        4.85457034e-01, -1.08739517e+00,  4.03058472e-01,  1.49690891e+00,
       -1.34001009e-02, -6.74015559e-01,  1.65843682e+00, -2.64295755e-01,
       -2.57142084e-02, -1.63370557e-02,  1.30346710e-01, -2.09425896e-01,
        3.15630691e-01, -1.43057516e+00,  1.10560403e-01,  3.36109755e-01,
        2.62736664e-01,  4.60178899e-01, -1.80767914e+00, -1.15279030e+00,
        3.87616582e-01, -2.34836274e-01,  4.33519226e-01, -9.50040516e-01,
       -7.89095755e-01, -7.43079705e-01, -1.58963649e+00, -1.14926511e+00,
        5.81237653e-01,  5.52091224e-02, -8.62040886e-01, -2.10890153e-01,
       -1.30718927e-01, -7.74739089e-01, -2.55370290e-01, -5.37765312e-01,
        4.26586265e-01, -5.29406808e-01,  3.67505170e-01,  1.01103651e-01,
       -1.33239171e+00, -3.33114429e-01,  8.12170625e-01, -1.22833279e-01,
       -1.29294222e+00,  1.30325779e+00, -4.34522165e-01,  5.28698372e-01,
       -2.03314414e-01, -8.18725921e-01, -4.93013618e-01, -1.17244564e+00,
        9.51897317e-02, -1.11064401e+00, -4.20189467e-01,  2.74246723e-01,
        1.05449361e+00,  8.75428487e-02, -1.45714150e+00,  3.78033598e-01,
        1.07533718e+00, -2.07642256e+00,  1.79963171e+00,  1.03898193e-01,
        5.67387426e-01, -1.35280880e+00,  4.66547880e-01,  3.26820080e-01,
       -6.83271598e-01, -4.15131898e-01, -2.26878687e-01, -1.10648331e+00,
        7.21409604e-01,  4.20395487e-01, -1.07718506e-01,  1.17552299e+00,
       -1.20357732e+00,  4.79955253e-02, -2.43978912e-01, -1.76989766e+00,
        8.48379502e-01,  3.95289837e-01,  8.03427573e-01, -5.73563366e-01,
       -7.51640153e-01,  5.75477506e-01, -6.13693424e-01, -1.22720677e+00,
       -1.01455797e+00,  3.28792219e-01,  4.63980956e-01, -4.54711323e-01,
        1.41625566e+00, -1.16850971e+00, -1.97290901e+00, -6.30451402e-01,
       -5.59827762e-01,  7.92411256e-02, -8.12183597e-01,  2.83535472e-01,
       -1.70189117e-01,  1.75782562e-01, -3.83903868e-01, -5.21319955e-01,
       -6.78058772e-01,  6.04044095e-02, -4.50453369e-01, -1.31492639e+00,
        9.66889164e-01,  6.11925587e-01, -7.56254482e-01,  8.67490558e-01,
        3.53750097e-01, -7.88670061e-01, -2.02669586e-01, -1.37665821e+00,
        7.51664540e-01,  2.26064968e-01,  8.87211542e-01,  1.71878576e-01,
        1.78636804e+00, -2.65467345e-01,  1.69297278e-01,  5.15781776e-01,
        1.20719811e-01,  4.82086481e-01, -1.41419080e+00,  9.47692060e-01,
       -6.28306449e-01,  4.72898337e-01, -6.85130197e-01,  1.65208681e-01,
       -4.75927643e-02, -1.09946537e-01, -3.21882305e+00, -9.10427323e-01,
       -4.48113165e-01, -7.73546927e-01, -1.11851558e+00,  2.00797519e-01,
        4.24326629e-01, -2.79054999e-01,  1.10957259e+00,  5.36627556e-02,
        1.21651019e-01,  6.62052461e-01,  7.39719081e-01, -2.80441551e-01,
       -6.49869779e-01, -2.46262369e-01, -4.63571636e-01, -1.21282100e+00,
       -5.41094272e-01,  6.68273663e-01, -1.19211105e-01,  6.84796277e-02,
        8.12153957e-01, -4.27714613e-01, -2.64864623e-01, -3.77741549e-01,
        1.17692749e+00,  1.52538195e+00, -1.00951897e-02, -9.66240726e-01,
       -1.95658299e+00, -4.93630029e-01,  9.72905876e-01,  6.48141157e-01,
        1.94510348e+00, -1.06616968e+00,  6.23601259e-01, -4.03862943e-01,
       -3.58749277e-01, -3.16984617e-01, -2.07963974e-02, -1.37062872e+00,
        5.30379509e-02,  1.14728592e-01, -3.77680491e-01,  1.64350228e+00,
       -1.33093249e+00, -1.16311961e+00,  2.99614198e-01,  6.54088615e-01,
        1.53851477e+00, -2.37696525e+00, -1.47783988e+00, -1.25566142e+00,
        1.11207935e+00,  3.95003616e-01, -3.45435120e-01,  1.45649265e-01,
        1.23655643e+00, -6.58185621e-01, -1.17689634e-01, -4.86993610e-01,
       -8.06187043e-01, -6.45520612e-01, -3.36616618e-01, -6.59181665e-01,
        3.73488863e-01, -1.22765661e+00, -3.02408325e-01, -8.52188435e-01,
       -4.81994352e-01, -4.71905807e-01,  9.31164651e-01, -1.67903902e+00,
       -8.98810463e-01, -1.91063670e+00, -6.93030022e-01,  6.31148523e-01,
       -2.81256461e-01,  1.22616050e+00, -7.70579727e-01,  8.44697391e-01,
        1.48556624e+00,  3.11568196e-01, -4.90287917e-01,  1.08933635e+00,
       -9.85510494e-01, -6.53041366e-01,  1.71518533e-01,  1.34644192e-01])

In [104]:
cats = pd.qcut(data,4) # 4분위 값으로 나누기
cats

[(-0.0643, 0.571], (0.571, 2.882], (0.571, 2.882], (0.571, 2.882], (-0.0643, 0.571], ..., (0.571, 2.882], (-3.2199999999999998, -0.679], (-0.679, -0.0643], (-0.0643, 0.571], (-0.0643, 0.571]]
Length: 1000
Categories (4, interval[float64]): [(-3.2199999999999998, -0.679] < (-0.679, -0.0643] < (-0.0643, 0.571] < (0.571, 2.882]]

In [105]:
pd.value_counts(cats)

(0.571, 2.882]                   250
(-0.0643, 0.571]                 250
(-0.679, -0.0643]                250
(-3.2199999999999998, -0.679]    250
dtype: int64

In [106]:
pd.qcut(data,[0,0.1,0.5,0.9,1]) # 직접 지정도 가능하다.

[(-0.0643, 1.205], (-0.0643, 1.205], (-0.0643, 1.205], (1.205, 2.882], (-0.0643, 1.205], ..., (-0.0643, 1.205], (-1.22, -0.0643], (-1.22, -0.0643], (-0.0643, 1.205], (-0.0643, 1.205]]
Length: 1000
Categories (4, interval[float64]): [(-3.2199999999999998, -1.22] < (-1.22, -0.0643] < (-0.0643, 1.205] < (1.205, 2.882]]

### 특잇값을 찾고 제외하기

In [108]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.032187     0.018913    -0.052726    -0.014956
std       1.032513     0.950051     1.018169     1.027998
min      -3.039219    -2.554556    -3.238828    -3.052849
25%      -0.673727    -0.625157    -0.771279    -0.661936
50%       0.056467     0.006823    -0.069238    -0.020608
75%       0.729644     0.660530     0.609147     0.657935
max       3.262793     3.385981     3.636632     3.302137

In [110]:
col = data[2]
col[np.fabs(col)>3]

60     3.290264
83    -3.023030
207   -3.017234
288   -3.238828
781    3.237503
958    3.636632
Name: 2, dtype: float64

In [116]:
data[(np.fabs(data)>3).any(1)] # 절댓값이 3이상인 값을 갖는 행 조회

            0         1         2         3
60  -2.531915  0.804038  3.290264 -0.793980
83   0.745660  1.601376 -3.023030 -2.161774
162 -0.379945  0.064234 -0.392055  3.006279
207  0.394927 -0.152767 -3.017234  0.282655
246  0.317882 -0.741382 -0.385373  3.028111
288  0.136956 -0.190734 -3.238828 -0.797669
319  3.262793  0.921145 -0.012312  0.467349
353  0.385170  2.632474  0.366237  3.302137
608  0.671011 -0.052194  0.325479  3.159128
635 -3.039219  1.519489 -0.497300 -0.472006
650 -0.677871  3.234754 -1.974334 -0.194232
745  2.215067  3.385981 -0.191408  0.053311
781  1.025973  0.544530  3.237503  1.038577
797 -0.292259 -0.977320 -0.835351 -3.052849
856 -0.422389 -0.794304 -0.224627  3.071298
958 -0.184772  1.038984  3.636632 -0.850296

In [127]:
data[np.fabs(data)>3] = np.sign(data)*3 # 부호판별(np.sign)

In [128]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.031963     0.018292    -0.053611    -0.015470
std       1.031607     0.947991     1.013558     1.026117
min      -3.000000    -2.554556    -3.000000    -3.000000
25%      -0.673727    -0.625157    -0.771279    -0.661936
50%       0.056467     0.006823    -0.069238    -0.020608
75%       0.729644     0.660530     0.609147     0.657935
max       3.000000     3.000000     3.000000     3.000000

In [130]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0  1.0
2  1.0  1.0 -1.0  1.0
3 -1.0  1.0  1.0  1.0
4  1.0 -1.0  1.0 -1.0

### 치환과 임의 샘플링

In [131]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)

In [132]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [133]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [135]:
df.iloc[sampler]

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [138]:
df.sample(n=3) # 임의의 값으로 n개를 샘플링

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19

In [139]:
choices =  pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True) # 복원 추출
draws

3    6
1    7
2   -1
0    5
3    6
0    5
1    7
4    4
0    5
2   -1
dtype: int64

### 표시자,더미변수 계산

In [141]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [143]:
pd.get_dummies(df['key']) #더미 원핫!!!

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [145]:
dummies = pd.get_dummies(df['key'],prefix='key') # 이름 지정
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [147]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [148]:
mnames = ['movie_id','title','genres']
movies = pd.read_table('./movies.dat',sep='::',header=None, names = mnames)

C:\Users\Playdata\anaconda3\lib\site-packages\ipykernel_launcher.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [150]:
movies.head(10)

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [153]:
all_genres = []

for x in movies.genres:
    all_genres.extend(x.split('|')) #리스트끼리의 합(리스트의 원소들을 앞 리스트에 넣는다.)
    
genres = np.unique(all_genres)

genres

array(['Action', 'Adventure', 'Animation', "Children's", 'Comedy',
       'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror',
       'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War',
       'Western'], dtype='<U11')

In [155]:
zero_matrix = np.zeros((len(movies),len(genres)))

dummies = pd.DataFrame(zero_matrix, columns = genres)

dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [156]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [157]:
dummies.columns.get_indexer(gen.split('|')) # col 위치 반환

array([2, 3, 4], dtype=int64)

In [158]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices] = 1

In [160]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

movies_windic.iloc[1]

movie_id                                        2
title                              Jumanji (1995)
genres               Adventure|Children's|Fantasy
Genre_Action                                    0
Genre_Adventure                                 1
Genre_Animation                                 0
Genre_Children's                                1
Genre_Comedy                                    0
Genre_Crime                                     0
Genre_Documentary                               0
Genre_Drama                                     0
Genre_Fantasy                                   1
Genre_Film-Noir                                 0
Genre_Horror                                    0
Genre_Musical                                   0
Genre_Mystery                                   0
Genre_Romance                                   0
Genre_Sci-Fi                                    0
Genre_Thriller                                  0
Genre_War                                       0
Genre_Western                                   0
Name: 1, dtype: object

In [161]:
np.random.seed(12345)
values = np.random.rand(10)

values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [162]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 문자열 다루기

In [163]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [166]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [168]:
'::'.join(pieces)

'a::b::guido'

In [170]:
'guido' in pieces

True

In [171]:
val.index(',')

1

In [172]:
val.find(':') # 없으면 -1

-1

In [174]:
val.index(':') # 없으면 error

ValueError: substring not found

In [175]:
val.count(',')

2

In [176]:
val.replace(',','::')

'a::b:: guido'

In [177]:
val.replace(',','')

'ab guido'

### 정규표현식

In [178]:
import re

text = 'foo bar\t baz \tqux'

re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [179]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [180]:
regex = re.compile(pattern, flags=re.IGNORECASE) # re.IGNORECASE 대소문자를 가지리 않게한다.

In [181]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [184]:
m = regex.search(text) # 처음 것만 찾음
m

In [185]:
text[m.start():m.end()]

'dave@google.com'

In [187]:
print(regex.match(text)) # 시작과 일치하는지 알려줌

None

In [188]:
print(regex.sub('REDACTED', text)) # 찾은 문자열 치환

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [189]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})' # 괄호로 그룹나눔
regex = re.compile(pattern, flags=re.IGNORECASE)

In [191]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [192]:
regex.findall(text) # 그룹을 튜플로 묶어줌

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [193]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text)) # \1 : 첫번째 그룹

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### pandas 벡터화된 문자열 함수

In [194]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [200]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [201]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [202]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [220]:
data.str.get(0) # index값으로 찾을 수 있다.

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [219]:
data.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [221]:
data.str[:5] # 스플라이싱가능

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object